# یک عدد از کاربر بگیر ید و بررسی کن ید که آیا هم بر 2 و هم بر 5 بخش پذیر است یا نه
# x = int(input("Enter your number : "))
# if x % 2 == 0 and x % 5 == 0:
#     print("Yes")
# else:
#     print("No")
# --------------
# اضلاع یک مثلث را از کاربر گرفته و مشخص کن ید که آیا این اضالع تشکیل مثلث میدهند یا خی ر؟ اگر جواب مثبت است، چه نوع مثلثی؟
x, y, z = (input("x , y ,z :").split(","))
x = int(x)
y = int(y)
z = int(z)
if x + y > z:
    print("Yes")
    if x == y and y == z:
        print("متساوی الاضلاع")
    elif x == y or x == z or y == z:
        print("متساوی الساقین")
    elif (x ** 2 + y ** 2 == z ** 2) or (x ** 2 + z ** 2 == y ** 2) or (y ** 2 + z ** 2 == x ** 2):
        print("قائم")
    else:
        print("شکل واضحی ندارد")
else:
    print("No")
# --------------
# یک کاراکتر از کاربر بگیر ید و مشخص کن ید کاراکتر وارد شده عدد است، حروف انگل یسی است یا سایر نماد ها.
